package com.adu.util;

import java.util.Arrays;
import java.util.HashSet;
import java.util.List;
import java.util.Set;

import org.apache.commons.logging.Log;
import org.apache.commons.logging.LogFactory;
import org.junit.Test;

public class HashSetTest {
	private final Log logger = LogFactory.getLog(this.getClass());

	@Test
	public void contains() {
		String str = "匆匆那年";
		List<String> list = Arrays.asList("内地买家", "海关", "院士", "行车安全", "搜狗搜索",
				"C罗", "首尔FC", "加拿大女贼", "邻居", "孙杨", "陈伟霆", "陈思诚", "加分政策", "金秀贤",
				"贾静雯", "十月围城", "回应", "大师兄", "甄嬛传", "冒充", "丫丫", "嘴唇", "挥拳",
				"少妇", "印囧", "乘地铁", "国防部长", "冬奥", "爱出猫", "邓超老婆", "王菲", "故宫瓷母",
				"小伙犯错", "异地恋", "成龙", "北爱", "偷拍女生洗澡", "假币窝点", "偷情", "焚尸", "孙俪",
				"求助", "女乘客痛哭", "德甲", "色狼", "抢劫", "房祖名拘留", "跳楼", "看傻网友", "获封",
				"神奇梦幻夜", "总决赛", "半头人", "科技", "张雨绮老公", "大学生", "网上直播", "贝尔",
				"霍思燕孩子", "邓紫棋", "领证日", "韩寒女儿", "获奖短片", "赤裸炫富", "炫富", "判决",
				"停车不再是难事", "倪萍", "性关系", "李克强", "仁川亚运会", "张雨绮", "秀man",
				"王菲谢霆锋复合", "中方交涉", "倚天屠龙记", "第一伞兵队", "李立群", "蔡康永", "打车带路",
				"梧桐妹", "安全到家", "栅栏", "高仿假币", "皇马", "情侣亲热", "邓超", "搜狗搜索微信",
				"新娱乐在线", "蜂王浆", "纠缠", "极端组织", "摸臀部", "微博", "马云", "辅警", "吐血",
				"Xposed", "打印颅骨", "应届毕业生", "杜江", "会见", "王宝强老婆", "曹郁",
				"少林寺起诉政府", "整装待发", "刘德华", "邵兵", "李妮娜", "岳父", "高虎被抓", "刘铁男",
				"王宝强妻子", "中国魔术师", "集锦", "新规", "佟丽娅", "臀部", "斗殴", "霍思燕老公", "徐峥",
				"马里奥·格策", "霍思燕", "释永信", "小s", "校长", "猫咪", "拍卖", "杀害婆婆", "实战演练",
				"iPhone6", "盖房摔伤", "穿戴奢华", "中国首富", "女孩失联", "猥琐男", "病危", "向华强",
				"杨幂", "李易峰", "李宇春", "天龙八部", "少林寺门票", "空袭", "被咬死", "交通事故",
				"倾家荡产", "梅雨季", "分家", "吉安女书记", "疯狂英语", "穿越长江", "淑女班", "王全安嫖娼",
				"搜狗", "手机", "威胁", "诱饵", "贾静雯前夫", "张光北", "美国国防部", "瓶盖", "分家纠纷",
				"狗狗", "娱乐播报调查", "康熙来了", "老虎", "劫杀", "无偿献血", "文章", "高校老师", "潮湿",
				"失联女孩", "华人", "受贿案", "漂浮的国家", "m3w96", "凌潇肃", "王全安", "龙门飞甲",
				"西甲", "联合训练", "砸扁轿车", "文章出轨", "吴亦凡", "EXO", "理想前程有Say有Way",
				"金秀贤代言搜狗", "央视", "李学林", "四川失联女孩", "华谊兄弟", "出轨", "小野", "喵星人",
				"等着我", "乱摸", "饭店", "MVP", "浦项制铁", "蒲巴甲", "抛尸茅厕", "贾静雯女儿",
				"房祖名吸毒", "倪萍整容", "看黄片", "姚笛", "拜仁", "干爹", "李宁", "国民岳父", "韩小野",
				"孙俪老公", "顺走", "夫妻生活", "谢霆锋", "开庭", "睡裤", "王宝强", "高速亲热",
				"Running", "马伊琍", "长安", "北京爱情故事", "景区暴利", "资料视频", "招聘", "白鹿原",
				"迪士尼", "李宇春长发", "勒索", "后会无期", "习主席", "中考", "少年跳楼", "逸动", "张景岚",
				"创意", "斧头", "女婿", "罗永浩", "二次曝光", "陈岚", "胡润百富榜", "开锁", "姚晨",
				"我是歌手2", "前男友出面道歉", "烧伤", "出彩中国人", "女孩", "锋菲复合", "勒死", "光脚院士",
				"警察", "向华强周星驰", "扣押渔船", "高虎吸毒", "秋季", "iphone6", "辽宁舰", "Man",
				"高虎女友", "王宝强作品", "哈萨克斯坦", "小伙胸部", "2014款", "韩寒", "恶搞", "李小文",
				"基金账务", "咸猪手", "自由泳", "全球最性感罪犯", "碰瓷", "高虎", "赖床", "章子怡",
				"金胜大", "李阳", "大连渔船", "偷吃", "追尾", "高额报酬", "离婚官司", "蓝翔", "门票分成",
				"走私", "辱骂", "15秒", "专案组", "西游记", "房祖名", "公交车", "批评", "失足女",
				"牙齿", "沐浴露", "领导", "笑到你", "无人机", "走私武器弹药", "大妈", "CBA", "少妇炫富",
				"罚站", "儿媳杀婆婆", "全球鹰", "越狱", "马蓉", "古剑奇谭", "少帅", "未婚妻", "小伙",
				"李阳皈依少林", "姚晨出轨", "春哥", "被捕", "亲生妹妹", "刘翔", "东海舰队", "别样军训",
				"中方渔船", "周星驰");
		Set<String> set = new HashSet<String>(list);
		if (set.contains(str)) {
			logger.debug("true");
		} else {
			logger.debug("false");
		}

	}
}
